Enums/СостоянияОтправкиПодтвержденияГИСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СостоянияОтправкиПодтвержденияГИСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбратьПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияОтправкиПодтвержденияГИСМ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает список состояний, при которых не требуется поступление.
//
// Возвращаемое значение:
//	СписокЗначений - список состояний
//
Функция СписокСостоянийНеТребуетсяПоступление() Экспорт

	СписокСостоянийНеТребуетсяПоступление = Новый СписокЗначений;
	СписокСостоянийНеТребуетсяПоступление.Добавить(Перечисления.СостоянияОтправкиПодтвержденияГИСМ.ОжидаетсяПоступление);
	СписокСостоянийНеТребуетсяПоступление.Добавить(Перечисления.СостоянияОтправкиПодтвержденияГИСМ.ВыбратьПоступление);
	
	Возврат СписокСостоянийНеТребуетсяПоступление
	
КонецФункции

// Функция возвращает список состояний, при которых недоступно изменений поступления.
//
// Возвращаемое значение:
//	СписокЗначений - список состояний
//
Функция СписокСостоянийНедоступныИзмененияПоступления() Экспорт
	
	СписокСостоянийНедоступныИзменения = Новый СписокЗначений;
	СписокСостоянийНедоступныИзменения.Добавить(Перечисления.СостоянияОтправкиПодтвержденияГИСМ.КПередаче);
	СписокСостоянийНедоступныИзменения.Добавить(Перечисления.СостоянияОтправкиПодтвержденияГИСМ.Передано);
	СписокСостоянийНедоступныИзменения.Добавить(Перечисления.СостоянияОтправкиПодтвержденияГИСМ.ПринятоГИСМ);
	
	Возврат СписокСостоянийНедоступныИзменения;

КонецФункции 

#КонецОбласти

#КонецЕсли
